{
  "Welcome": "Willkommen",
  "School": "Schule",
  "Cooperative State University": "Duale Hochschule",
  "Gantry System": "Raumportal",
  "Product Catalog": "Produktkatalog",
  "Welding Guns": "Schweißzangen",
  "Digital Learning": "Digitales Lernen",
  "Home Automation": "Hausautomatisierung",
  "Switzerland": "Schweiz",
  "loading": "Lädt...",
  "play": "Start",
  "next": "Weiter",
  "continue-anyway": "Trotzdem fortfahren",
  "please-rotate": "Diese Webseite ist nicht für Mobilgeräte. Bitte drehen Sie das Gerät zum Querformat, um diese Website anzuzeigen.",
  "welcome-p1": "<h2>Guten Tag,</h2><p>Ich bin Christian, ein erfahrener deutscher Softwareentwickler mit <b>4 Jahren</b> wertvoller Branchenpraxis. Mein Ziel ist es, mich als Experte für .NET-Technologie zu etablieren.</p><p>Dank meiner Jugend vereine ich solide Fachkenntnisse mit innovativem Fortschritt.</p>",
  "welcome-p2": "<p>Derzeit arbeite ich als <b>Full-Stack-Entwickler</b> bei <b>Festo Didactic SE</b>. Erlauben Sie mir, Sie auf eine Reise mitzunehmen, die mich zu dieser Position geführt hat. Nutzen Sie die interaktiven Funktionen über die 'Next'- und 'Previous'-Schilder.</p>",
  "welcome-p3": "<p><b>Hinweis:</b> Dieses Projekt markiert meinen ersten Versuch, Design- und Modellierungstechniken anzuwenden. Ich bin kein professioneller Designer.</p>",
  "school-p1":"<p>Meine Reise in die Programmierung begann im Alter von 10 Jahren, anfangs fasziniert von Lernplattformen wie <b>AntMe</b> und anpassbaren Mainstream-Spielen. Das Eintauchen in <b>C# für Kinder</b> festigte mein Verständnis für Logik, objektorientierte Programmierung und die Ethik der Softwareentwicklung.</p>",
  "school-p2":"<p>Praktika bei renommierten Unternehmen wie <b>EMAG</b>, <b>Heldele</b> und <b>SE-Electronics</b> bekräftigten meinen Entschluss, nach Abschluss meines Abiturs eine Karriere in Bereich Informatik anzustreben.</p>",
  "school-p3":"<h2>Schüleringenieurakademie</h2><p>Im vorletzten Schuljahr nahm ich an einem einjährigen Seminarfach teil, durchgeführt von der Hochschule Esslingen in Göppingen, Deutschland. In Zusammenarbeit mit Schülern verschiedener Schulen bauten wir ein selbstfahrendes RC-Auto. Dabei wurden vorgegebene Komponenten wie Hauptchassis, Hauptplatine und Motoren verwendet, während wir unsere Autonomie in Entscheidungsfindung ausübten.</p>",  
  "school-p4":"<p>Diese intensive Erfahrung gab uns frühzeitig Einblicke in Projektmanagement, Beschaffungsstrategien, Technologieauswahl und Implementierungsmethoden durch autonome Entscheidungsfindung.</p>",
  "school-p5":"<p>Unter der Aufgabe, von Dozenten und Produktbesitzern festgelegte Spezifikationen einzuhalten, erlangte ich Kompetenz in der Embedded-Programmierung mit <b>C</b>, <b>Arduino</b> sowie in der Interaktion mit Sensoren und Aktuatoren. Zudem erhielt ich wertvolle Einblicke in die kollaborative Softwareentwicklung im Team, die oft bis in die Abendstunden reichte.</p>","dhbw-p1": "<p>Nach meinem Abitur 2020 absolvierte ich ein Informatik-Bachelorstudium mit Schwerpunkt Data Science an der <b>Dualen Hochschule Baden-Württemberg</b> (DHBW) in Stuttgart. Mit <b>Festo SE & Co. KG</b> als mein Partnerunternehmen, einem führenden Unternehmen der Automatisierungsbranche, erlangte ich umfangreiche akademische und praktische Erfahrungen.</p><p>Aufgrund interner Richtlinien kann ich keine Studienergebnisse teilen, da sie Eigentum von Festo SE & Co. KG sind.</p>",
  "dhbw-p2": "<h2>Duale Hochschulen</h2><p>Die DHBW ist eine einzigartige Institution in Deutschland, die durch ihr innovatives Bildungsmodell gekennzeichnet ist. Durch abwechselnde <b>drei-monatige Theoriephasen</b> an der Hochschule und <b>drei-monatige Praxisphasen</b> bei Partnerunternehmen erhalten die Studierenden eine dynamische Lernumgebung, die Theorie und Praxis verbindet. Dieser integrative Ansatz fördert ein tiefes Verständnis der Industrie bereits früh im Bildungsweg.</p>",
  "dhbw-p3": "<h2>Theoriephasen</h2><p>Während der Theoriephasen erlangte ich umfassende Kenntnisse in grundlegenden Prinzipien der Informatik und Data Science. Mein Lehrplan umfasste Themen wie Softwareentwicklung, Projektmanagement, Softwarearchitekturen, Datenbanken, maschinelles Lernen und Mensch-Maschine-Interaktionen.</p>",
  "dhbw-p4": "<h2>Praxisnahe Projekte</h2><p>Ein wesentlicher Teil der Prüfungen bestand aus praxisnahen Gruppenprojekten, die zwischen 50 und 200 Stunden individuellen Einsatz erforderten. Diese Projekte deckten verschiedene Bereiche ab, darunter eingebettete Systeme mit Low-Level-Programmierung, Webentwicklung, proaktive Assistenzsysteme und Datenanwendungen. Zusätzlich gab es Fallstudien, theoretische Analysen und schriftliche Prüfungen.</p>",
  "dhbw-p5": "<h2>Praxisphasen</h2><p>Während meiner Praxisphasen bei Festo SE & Co. KG integrierte ich mich in verschiedene Abteilungen und übernahm Aufgaben, die zur operativen Effizienz beitrugen. Durch Vollzeitarbeit an Projekten mit einer Dauer von 3 bis 6 Monaten trug ich wesentlich zur Umsetzung von Meilensteinprojekten bei.</p>",
  "gantry-p1": "<p>Das Projekjt handelt von der Entwicklung einer Proof-of-Concept-VSCode-Erweiterung für eine firmeninterne Interpretersprache zur Steuerung von Festo-Raumportalen.</p><p>Das Projekt ersetzte die konventionelle Steuerung über CODESYS und Steuerungseinheit. Die Erweiterung bietet umfassende Sprachunterstützung, Dateiübertragungsfähigkeiten und Simulationsfunktionen.</p>",
  "gantry-p2": "<p><b>Verwendete Technologien</b>: .NET, C#, OmniSharp Typescript, FTP, LSP, CODESYS, three.js<br /><b>Zeitrahmen</b>: 3 Monate</p>",
  "gantry-p3": "<h2>Serverseite</h2><p>Zur Umsetzung der Sprachunterstützung verwendet VSCode das LSP (Language Server Protocol). Das JSON-RPC-basierte Protokoll erleichterte die Kommunikation zwischen Sprachserver und Editor. LSP gewährleistet Anpassungsfähigkeit auf verschiedenen Code-Editoren.</p>",  
  "gantry-p4": "<p>Der Sprachserver wurde in C# implementiert, da die Interpretersprache hauptsächlich in C# geschrieben war. Der .NET OmniSharp LSP-Server erleichtert eine solche Integration. Er leistet robuste Fehlerbehandlungsfähigkeiten für die Clientseite.</p>",  
  "gantry-p5": "<h2>Clientseite</h2><p>VSCode verwendet Typescript zusammen mit eingebetteten APIs für Erweiterungen. Das ermöglicht eine effektive Kommunikation mit der Serverseite. Die Clientseite bietet wesentliche Funktionen wie Syntaxhervorhebung, Definitionssuche und Hover-Funktionalität über einen JSON-basierten Token- und Dokumentationsspeicher.</p>", 
  "gantry-p6": "<h2>Integration des Raumportals</h2><p>Der Projektumfang hat sich durch die schnelle Umsetzung der Aufgabe vergrößert. Die Erweiterung soll Raumportale integrieren und den Benutzern die Möglichkeit geben, Portalsysteme über die Interpretersprache zu programmieren. Die Erweiterung umfasste drei Komponenten: Dateiübertragung, Kommunikation und Steuerung.</p>",
  "gantry-p7": "<p>Die Dateiübertragungsfunktionalität integriert vorhandene FTP-Logik, um Benutzern das Hochladen, Herunterladen und Löschen von Skripten vom Portalsystem zu ermöglichen. Die Modifikation der Schnittstelle zum CODESYS-Laufzeitumfeld ermöglicht die Verbindung zum Raumportal für Steuerungszwecke.</p>",
  "gantry-p8": "<p>Der nächste Schritt bettet eine anspruchsvolle Simulation des Raumportals in die Erweiterung ein. Die Simulation ist durch Echtzeitpositionsdaten gesteuert unter Nutzung eines vorhandenen three.js-Modells. Das ermöglicht eine Entwicklung ohne phisikalisches Raumportal und legt den Grundbaustein für erweiterte Debugging-Funktionen innerhalb der Simulationsumgebung.</p>",
  "catalog-p1": "<p>Dieses Projekt zielt darauf ab, eine Starteranwendung für den Festo Produktkatalog zu entwickeln. Die Anwendung dient als optionales Werkzeug, das es Benutzern ermöglicht, benutzerdefinierte Informationen und Funktionsdateien mühelos zu verwalten.</p>",
  "catalog-p2": "<p><b>Verwendete Technologien</b>: .NET, C#, WinForms (entwickelt innerhalb von Visual Studio)<br /><b>Zeitrahmen</b>: 3 Monate</p>",
  "catalog-p3": "<h2>Hintergrund</h2><p>Der Festo Produktkatalog wird weltweit von einer großen Nutzerbasis genutzt. Er ist in Pascal mit der Delphi-IDE geschrieben.</p>",
  "catalog-p4": "<p>Viele Benutzer benötigen spezifische Informationen wie Lieferanten und Preise für jedes Produkt. Um diesem Bedarf gerecht zu werden, gestaltet sich die Anwendung erweiterbar, sodass Benutzer INI-Dateien in das Programmverzeichnis integrieren können.</p>",
  "catalog-p5": "<p>Die Verwaltung dieser Dateien ist jedoch ursprünglich mit der Navigation durch vorgefertigte Ordner verbunden, was für Endbenutzer umständlich ist. Zur Verbesserung der Benutzererfahrung fand die Entwicklung dieser Desktop-Anwendung statt.</p>",
  "catalog-p6": "<h2>Entwicklung</h2><p>Die Anwendung wurde in C# mit WinForms entwickelt. Dies legt den Grundstein für eine anschließende Migration der Hauptanwendung auf .NET. Das Hauptziel bestand darin, das Dateimanagement zu optimieren, indem verstreute Dateien an einem einzigen, leicht zugänglichen Ort konsolidiert wurden.</p>",
  "catalog-p7": "<p>Zu den Funktionen gehören die Extraktion, Validierung und Anzeige von INI-Dateien innerhalb der Anwendungsoberfläche. Das ermöglicht Benutzern, Konfigurationen schnell zu ändern. Darüber hinaus können Benutzer den Dateiinhalt mit einem bevorzugten Texteditor bearbeiten.</p>",
  "catalog-p8": "<p>Benutzer haben außerdem die Möglichkeit, Sammlungen von INI-Dateien zum Starten der Hauptproduktkatalog-App innerhalb der Starteranwendung anzulegen und zu bearbeiten.</p>",
  "welding-p1": "<p>Meine Bachelorarbeit konzentrierte sich auf die Entwicklung eines Schweißzangenwartungssystems in Zusammenarbeit mit Festo. Das Projekt legte den Fokus auf theoretische Aspekte. Die erste Phase umfasste die Implementierung von Black-Box-Tests an einer externen Komponente durch die Simulation von Schweißzangendaten, die an einen MQTT-Broker übertragen wurden.</p>",
  "welding-p2": "<p>Der Kern der Arbeit liegt in der Bewertung der Softwarequalität in einem solch komplexen System. Sie identifiziert Systemschwächen und schlägt Korrekturmaßnahmen vor, indem Tests in das Dashboard der Anwendung integriert werden. Darüber hinaus beschreibt sie die Automatisierung dieser Tests und zeigt ihre Integration in den Anwendungslebenszyklus auf.</p>",
  "welding-p3": "<p><b>Verwendete Technologien</b>: .NET, Xunit, Codebeamer, Swagger, PowerBI, Leapwork<br /><b>Zeitrahmen</b>: 6 Monate</p>",
  "welding-p4": "<p><h2>Messung der Softwarequalität</h2>Die Arbeit untersucht ausführlich die Entwicklung projektspezifischer Metriken, die aus einem Fragebogen zur Priorisierung von Produktspezifikationen abgeleitet sind. Diese Metriken bewerten die Betonung von Qualitätsmerkmalen im Vergleich zur Gesamtpriorisierung durch Experten. So erleichtern sie die Identifizierung von Defiziten und Überimplementierungen.</p>",
  "welding-p5": "<p><h2>Verbesserung der Softwarequalität</h2>Um identifizierte Probleme anzugehen, konzentriert sich die Arbeit auf Testschnittstellen zwischen Systemkomponenten. Zunächst untersucht sie die Schnittstelle mit einer externen Komponente mithilfe von Xunit-Skripten, um Schweißzangendaten zu simulieren und die Kompatibilität mit den erwarteten Daten für die externe Black-Box zu gewährleisten.</p>",
  "welding-p6": "<p>Darüber hinaus untersucht die Arbeit die Schnittstelle zwischen Daten und Dashboard und führt Tests in Leapwork durch, um die ordnungsgemäße Datenanzeige am Ende des Benutzers zu überprüfen. Dem folgt eine Weiterleitung der automatisierter Testergebnisse in das Codebeamer-Anwendungslebenszyklus-Management-Tool mithilfe von .NET. Dies umfasst die Vereinfachung der Codebeamer-API, um Testergebnisse nahtlos mit Codebeamer-Elementen zu verknüpfen und den Testprozess zu optimieren.</p>",
  "welding-p7": "<p>Die in der Arbeit beschriebene Methodik ist universell anwendbar auf Spezifikationen, User Stories, Technologien und Projekte und bietet einen robusten Rahmen für die weitere Erforschung und Verfeinerung des Themas.</p>",
  "didactic-p1": "<p>Nach Abschluss meines Bachelorstudiums der Informatik übernahm ich eine Position als Full-Stack-Entwickler bei Festo Didactic SE & Co. KG, wo ich aktuell an zwei bedeutenden Projekten beteiligt bin.</p>",
  "didactic-p2": "<p><h2>Backend-Migration von PHP nach .NET</h2>Angesichts der Sicherheitsrisiken, die mit der Einstellung des PHP-Backends für IIS-Server verbunden sind, wurde strategisch beschlossen, zu .NET zu migrieren, anstatt auf nginx umzusteigen. Diese umfassende Migration beinhaltet die Entwicklung einer neuen API sowie die Implementierung einer Swagger-Seite für Entwickler, um einen reibungslosen Übergang sowohl der Frontend- als auch der Backend-Funktionalitäten zur neuen Infrastruktur sicherzustellen.</p>",
  "didactic-p3": "<p><h2>Frontend-Revision</h2>Ein umfassender Umbau ist im Gange, um die Benutzerfreundlichkeit des Inhaltsautoren-Frontends zu verbessern. Die Neugestaltung basiert nicht mehr auf dem bisherigen Paradigma des Point-and-Click, sondern auf einer intuitiveren Drag-and-Drop-Benutzeroberfläche, die sowohl Anfänger als auch erfahrene Fachleute anspricht.</p>",
  "didactic-p4": "<p>Diese Neugestaltung fördert auch eine umfassendere Benutzererfahrung, indem sie von der bisherigen spaltenbasierten Struktur zu einem Rasterlayout wechselt. Durch die reine Verwendung von Vanilla JavaScript liegt die Herausforderung darin, Legacy-Funktionalitäten mit dem modernen TechStack der Hauptseite zu verbinden. Die Anpassung an React und TypeScript gewährleistet eine stabile und zukunftsorientierte Lösung.</p>",
  "private-p1": "<p>Diese Demo zeigt eine Anwendung, die ich persönlich entwickelt habe, um die Heimautomatisierung für meinen Verwandten zu erleichtern. Sie umfasste die Planung und Integration von KNX in sein neugebautes Haus, um die Kontrolle über Beleuchtung und andere elektrische Komponenten zu ermöglichen.</p>",
  "private-p2": "<p>Das Herzstück dieses Systems dreht sich um eine Node-RED-Instanz, die auf einem Ubuntu-Raspberry Pi in seinem lokalen Netzwerk gehostet wird. Dieser Server orchestriert die Kommunikation zwischen verschiedenen Komponenten. Er interagiert mit seinem Alexa-Konto und gewährt ihm eine sprachgesteuerte Steuerung seines Zuhauses. Gleichzeitig kommuniziert er mit einem anderen Raspberry Pi, der als Webserver für meine privaten Projekte fungiert.</p><p>Zentral für diese Einrichtung ist ein WebSocket, der eine Echtzeitkommunikation zwischen den beiden Raspberry Pis herstellt. Dieser WebSocket erleichtert die Übertragung von Ereignissen und Statusaktualisierungen zwischen den verschiedenen Endpunkten und ermöglicht eine reaktionsschnelle und nahtlose Benutzererfahrung.</p>",
  "switzerland-p1": "<p>Als deutscher Entwickler, der sich um eine Stelle in der Schweiz bewirbt, möchte ich kurz meine Absichten klären:</p>",
  "switzerland-p2": "<p>Ich strebe danach, in der ländlichen Schweiz Wurzeln zu schlagen, eine Familie und ein Zuhause/Hof aufzubauen und mich langfristig zu integrieren. Mein Ziel ist es, eine tiefgreifende Leidenschaft und Stolz in meinem Arbeitsbereich zu pflegen. Daher suche ich nach einer Anstellung, die mit diesen Zielen im Einklang steht und meine Familie versorgen kann.</p>",
  "switzerland-p3": "<p>Wenn Sie auf dieser Seite gelandet sind, zeigt dies mein starkes Interesse daran, mehr über Ihr Unternehmen, dessen Abläufe und insbesondere dessen Methoden zu erfahren. Idealerweise werden unsere Ziele harmonieren und eine gegenseitig vorteilhafte Partnerschaft fördern, die ich gerne annehmen würde.</p>",
  "switzerland-p4": "<p>Unabhängig vom Ergebnis können Sie mich gerne über die bereitgestellte E-Mail-Adresse kontaktieren.</p>",
  "switzerland-p5": "<p>Diese selbstgemachte Welt ist ein Zeugnis meiner eigenen Kreativität. Unten finden Sie die Links:</p>",
  "switzerland-p6": "<p>Ich möchte dem Spline-Team für ihre außergewöhnliche Arbeit an der kostenlosen 3D-Design-Software danken. Dieses Tool hat meinen Einstieg in die Welt des 3D-Designs erheblich erleichtert und die Erstellung des hier gezeigten Modells ermöglicht. Die React-Integration verbessert die Entwicklerfreundlichkeit und ermöglicht eine nahtlose Anpassung der Benutzerempfindens.</p>",
  "switzerland-p7": "<p>Ich empfehle dringend, Spline für ähnliche Projekte zu erkunden. Ihre prompte Behebung identifizierter Probleme und Unterstützung bei der Optimierung der Seitenleistung waren von unschätzbarem Wert für mich.</p>"
}