{
  "Welcome": "Willkommen",
  "School": "School",
  "Cooperative State University": "Cooperative State University",
  "Gantry System": "Gantry System",
  "Product Catalog": "Product Catalog",
  "Welding Guns": "Welding Guns",
  "Digital Learning": "Digital Learning",
  "Home Automation": "Home Automation",
  "Switzerland": "Switzerland",
  "loading": "Loading...",
  "play": "Play",
  "next": "Next",
  "welcome-p1": "<h2>Greetings,</h2><p>I am Christian, a proficient German software developer boasting <b>4 years</b> of invaluable industry experience. My aspiration is to excel as a specialist in .NET technology.</p><p>Due to my youth, I offer a unique blend of seasoned expertise and cutting-edge innovation.</p>",
  "welcome-p2": "<p>Presently, I am employed at <b>Festo Didactic SE</b> in the capacity of a <b>Full Stack Developer</b>. Allow me to delve into the journey that led me to this position. Feel free to navigate through the stations using the interactive features provided, accessible via the 'Next' and 'Previous' signs.</p>",
  "welcome-p3": "<p><b>Disclaimer:</b> As mentioned, I am not a professional designer and this project marks my initial venture into applying design and modeling techniques.</p>",
  "school-p1":"<p>My journey in programming commenced at the age of 10, initially captivated by gamified learning platforms such as <b>AntMe</b> and customizable mainstream games. Digging into <b>C# for Kids</b> fortified my understanding of logic, object-oriented programming and the ethos of coding.</p>",
  "school-p2":"<p>Internships at esteemed firms including <b>EMAG</b>, <b>Heldele</b> and <b>SE-Electronics</b> further cemented my resolve to pursue a career in this domain upon completing my education.</p>",
  "school-p3":"<h2>Schüler Ingenieur Akademie</h2><p>During the latter years of my schooling, I seized the opportunity to engage in a year-long seminar project facilitated by Hochschule Esslingen in Göppingen, Germany. Collaborating with a diverse cohort of students from various schools, we embarked on constructing a self-driving RC car, leveraging predetermined components like the main chassis, main board and motors (see image) while also exercising our autonomy in decision-making.</p>",
  "school-p4":"<p>This immersive experience empowered us with early exposure to project management, procurement strategies, technology selection and implementation methodologies through autonomous decision-making.</p>",
  "school-p5":"<p>Tasked with adhering to specifications outlined by instructors and product owners, I gained proficiency in embedded programming utilizing <b>C</b>, <b>Arduino</b>, as well as interfacing with sensors and actuators. Furthermore, it provided invaluable insights into collaborative software development within a team dynamic, with sessions scheduled on Fridays from 2 pm onwards, often extending into the evening hours.</p>",
  "dhbw-p1":"<p>Upon completion of my Abitur in 2020, I pursued a Bachelor's degree in Computer Science with a specialization in Data Science at the <b>Cooperative State University Baden-Württemberg</b> (DHBW) in Stuttgart, Germany. Collaborating with <b>Festo SE & Co. KG</b>, a prominent global entity in the automation industry, I undertook rigorous academic and practical endeavors.</p><p>Due to coporate restrictions, I am not allowed to show any results from my studies as they are property of Festo SE & Co. KG.</p>",
  "dhbw-p2":"<h2>Cooperative State Universities</h2><p>The DHBW stands out as a distinctive institution in Germany, distinguished by its unique educational model. Through alternating <b>three-month theory</b> phases at the university and <b>three-month practical</b> phases at partner companies, students immerse themselves in a dynamic learning environment, bridging academic theory with real-world applications. This integrative approach fosters a profound understanding of industry dynamics early in the educational journey.</p>",
  "dhbw-p3":"<h2>Theory Semesters</h2><p>Throughout the theory semesters, I acquired comprehensive knowledge encompassing the foundational principles of computer science and data science. My curriculum encompassed diverse subjects including software development, project management, software architectures, databases, machine learning and human-machine interactions, among others.</p>",
  "dhbw-p4":"<p>A significant portion of the assessment involved hands-on group projects, which demanded between 50 to 200 hours of individual commitment. These projects spanned various domains including embedded systems with low-level programming, web development, proactive assistance systems and data applications. Additionally, assessments comprised case studies, theoretical analyses and written examinations, offering a multifaceted evaluation of competencies.</p>",
  "dhbw-p5":"<h2>Practical Semesters</h2><p>During my practical semesters at Festo SE & Co. KG, I integrated into diverse departments, assuming responsibilities crucial to operational efficacy. Engaging in full-time project work for durations spanning 3 to 6 months, I contributed significantly to the execution of projects, which are delineated as standalone milestones this journey.</p>",
  "gantry-p1": "<p>One notable project involved the development of a proof of concept VSCode extension for an in-house interpreted language designed to control Festo gantry systems, thereby supplanting the conventional control via CODESYS and control unit. The project encompassed comprehensive language support, file transfer capabilities and simulation functionalities for the gantry system.</p>",
  "gantry-p2": "<p><b>Technologies used</b>: .NET, C#, OmniSharp Typescript, FTP, LSP, CODESYS, three.js<br /><b>Time frame</b>: 3 months</p>",
  "gantry-p3": "<h2>Server Side</h2><p>The project employed the LSP (Language Server Protocol) within VSCode to provide robust language support. This protocol, based on JSON-RPC, facilitated communication between the language server and the editor, ensuring adaptability across various editing platforms.</p>",
  "gantry-p4": "<p>Owing to the interpreted language being predominantly written in C#, the language server was implemented in C# as well. Leveraging the .NET OmniSharp LSP server facilitated this integration, effectively wrapping the language server around the OmniSharp LSP server, customized to suit the unique requirements of the interpreted language. This approach ensured robust error handling capabilities for the client side, further enhancing the overall project integrity.</p>",
  "gantry-p5": "<h2>Client Side</h2><p>For the client-side implementation, VSCode utilizes Typescript along with embedded APIs for extensions. This enabled effective communication with the server side, empowering users with comprehensive error handling capabilities. Despite the absence of embedded documentation, the client side was ingeniously developed through reverse engineering existing code, thereby enabling essential functionalities such as syntax highlighting, go-to definition and hover functionality via a JSON-based token and documentation store.</p>",
  "gantry-p6": "<h2>Connecting the Gantry System</h2><p>Following the prompt completion of the primary objectives, the project scope was expanded to integrate gantry systems with the extensions, furnishing users with the capability to manipulate gantry systems through the interpreted language. This extension entailed three components: file transfer, communication and control.</p>",
  "gantry-p7": "<p>The file transfer functionality incorporated existing FTP logic into the extension, empowering users to upload, download and delete scripts from the gantry system. Communication enhancements were achieved by modifying the existing interface to the CODESYS runtime, facilitating connection to the gantry system for control purposes. This integration enabled the extension to retrieve status and position data from the gantry system, thus enhancing overall functionality.</p>",
  "gantry-p8": "<p>To further augment project capabilities, a sophisticated simulation of the gantry system was developed utilizing a pre-existing three.js model. This simulation, driven by real-time position data, provided users with a visual representation of gantry system movements, enabling script development without reliance on the physical gantry system. This addition not only enhanced user experience but also laid the groundwork for advanced debugging functionalities within the simulation environment.</p>",
  "catalog-p1": "<p>This project aimed to develop a foundational application for the Festo product catalog. It serves as an optional tool, enabling users to manage custom information and functionality files with ease.</p>",
  "catalog-p2": "<p><b>Technologies used</b>: .NET, C#, WinForms (developed within Visual Studio)<br /><b>Time frame</b>: 3 months</p>",
  "catalog-p3": "<h2>Background</h2><p>The Festo product catalog application is extensively utilized by a large user base worldwide. It's written in Pascal using the Delphi IDE.</p>",
  "catalog-p4": "<p>Many users require specific information such as suppliers and prices for each product. To address this need, the application was designed to be extensible, allowing users to incorporate ini files into the program directory.</p>",
  "catalog-p5": "<p>However, managing these files traditionally involved navigating through predefined folders, which proved cumbersome for end users. To enhance user experience, this desktop application was developed.</p>",
  "catalog-p6": "<h2>Development</h2><p>The application was crafted in C# utilizing WinForms. This lays the groundwork for a subsequent migration of the main app to .NET. The primary objective was to streamline file management by consolidating scattered files into a single, easily accessible location.</p>",
  "catalog-p7": "<p>Functionality includes the extraction, validation and display of ini files within the application interface, allowing users to swiftly modify configurations. Additionally, users can edit file contents using a favored text editor.</p>",
  "catalog-p8": "<p>Furthermore, users have the ability to save and edit collections of ini files for launching the main product catalog app within the starter application.</p>",
  "welding-p1": "<p>My bachelor's thesis focused on developing a Welding Gun Maintenance System in collaboration with Festo. Highlighting software quality, the project leaned more towards theoretical aspects than practical applications. The initial phase involved implementing black-box tests to an external component by simulating welding gun data transmitted to an MQTT broker.</p>",
  "welding-p2": "<p>The core of the thesis delves into assessing software quality within such a complex system. It identifies system deficiencies and proposes corrective measures by integrating tests into the application's dashboard. Furthermore, it outlines the automation of these tests, demonstrating their integration into the application lifecycle management pipeline.</p>",
  "welding-p3": "<p><b>Technologies used</b>: .NET, Xunit, Codebeamer, Swagger, PowerBI, Leapwork<br /><b>Time frame</b>: 6 Months</p>",
  "welding-p4": "<p><h2>Measurement of Software Quality</h2>The thesis extensively explores the development of project-specific metrics derived from a questionnaire on product specification prioritization. These metrics evaluate the emphasis placed on quality features compared to the overall prioritization by experts, facilitating the identification of deficits and over-implementations.</p>",
  "welding-p5": "<p><h2>Improving Software Quality</h2>To address identified issues, the thesis focuses on testing interfaces between system components. Initially, it examines the interface with an external component using Xunit scripts to simulate welding gun data, ensuring compatibility with expected data for the external black-box.</p>",
  "welding-p6": "<p>Furthermore, the thesis scrutinizes the interface between data and the dashboard, conducting tests in Leapwork to verify proper data display at the user's end. Notably, it proposes integrating automated test results into the codebeamer application lifecycle management tool via .NET. This involves simplifying the codebeamer API to seamlessly link test results with codebeamer items, streamlining the testing process.</p>",
  "welding-p7": "<p>The methodology outlined in the thesis is universally applicable across specifications, user stories, technologies and projects, providing a robust framework for further exploration and refinement of the topic.</p>",
  "didactic-p1": "<p>Upon completing my Bachelor's degree in Computer Science, I embarked on a role as a Full Stack Developer at Festo Didactic SE & Co. KG, where I've been engaged in two significant projects.</p>",
  "didactic-p2": "<p><h2>Backend Migration from PHP to .NET</h2>Recognizing the security risks posed by the discontinuation of the PHP backend for IIS Servers, a strategic decision was made to transition to .NET rather than switching to nginx. This comprehensive migration involved the development of a new API, along with the implementation of a Swagger site for developers, ensuring a flawless transition of both frontend and backend functionalities to the new infrastructure.</p>",
  "didactic-p3": "<p><h2>Frontend Enhancement</h2>Undergoing a substantial overhaul, the content creator's frontend is being revamped to enhance user-friendliness. The redesign pivots from the previous point-and-click paradigm to a more intuitive drag-and-drop interface, catering to both novice users and seasoned professionals.</p>",
  "didactic-p4": "<p>This redesign also fosters a more expansive user experience, leveraging a grid-based layout over the previous column-based structure. Despite the project's foundation in vanilla JavaScript, the challenge lies in bridging legacy functionalities with the adoption of the main sites modern TechStack featuring React and TypeScript, ensuring a stable and forward-looking solution.</p>",
  "private-p1": "<p>This demonstration showcases an application I personally developed to facilitate home automation for my relative. It involved the integration of KNX technology into his residence, offering unparalleled control over lighting and other electrical components.</p>",
  "private-p2": "<p>The core of this system revolves around a Node RED instance hosted on an Ubuntu Raspberry Pi within his local network. This server orchestrates communication between various components. It interfaces with his Alexa account, granting him voice-activated control over his home. Simultaneously, it interacts with another Raspberry Pi functioning as a web server for my private projects.</p><p>Central to this setup is a WebSocket, establishing real-time communication between the two Raspberry Pis. This WebSocket facilitates the transmission of KNX device statuses to the server and enables the execution of KNX actions initiated through the application.</p>",
  "switzerland-p1": "<p>As a German developer applying for a position in Switzerland, allow me to succinctly clarify my intentions:</p>",
  "switzerland-p2": "<p>I aspire to establish roots in rural Switzerland, cultivating a family and a home/farm, with a commitment to long-term dedication. My pursuit is to foster a profound sense of passion and pride in my field of work. Thus, I seek employment that aligns with these aspirations while providing for my family.</p>",
  "switzerland-p3": "<p>If you have arrived at this page, it indicates my keen interest in learning more about your company, its operations and particularly, its methodologies. Ideally, our objectives will harmonize, fostering a mutually beneficial partnership that I would eagerly embrace.</p>",
  "switzerland-p4": "<p>Regardless of the outcome, please feel free to reach out to me via the provided email address.</p>",
  "switzerland-p5": "<p>This self-made map is a testament to my resourcefulness. Below are the links:</p>",
  "switzerland-p6": "<p>I wish to express my gratitude to the Spline team for their exceptional work on the free 3D design software. This tool greatly facilitated my foray into the realm of 3D design, enabling the creation of the model showcased here. Their React integration enhances developer convenience, allowing for seamless customization of site aesthetics.</p>",
  "switzerland-p7": "<p>I highly recommend exploring Spline for any similar needs. Their prompt resolution of identified issues and assistance in optimizing site performance have been invaluable.</p>"
}